 [
    "Sit in a quiet place. Close your eyes. Slow your breathing. Notice your breath and how your body feels. What about your physical body are you thanking God for and why? Praise God for creating you in His image. You ARE fearfully and wonderfully made!",
    "Be still and quiet. Do you hear anything? What do you hear and why are you thankful for it? Praise God for the opportunity to be still in His presence and for the grace that allows you to fellowship with God.",
    "Look out your window. What do you see outside that you are grateful to see or to have? Thank God for the amazing world He created.",
"Take a look around you. What are the most basic, everyday things you don't think about? It could be a chair, clean water, or clothing. Write why you are thankful God blessed you with those necessities and how God provides in small ways in your life.",
"Think back to the time when you were in need. Reflect on how God provided for your needs. Spend time praising the Lord for His provision.",
"Recall one of your happiest experiences from your childhood. Why are you grateful for it? Praise God for the good times and fond memories in your life.",
"Remember a time when God's presence was near and you experienced Him in a fresh way. Reflect on how His presence impacted your life and what it meant to you.",
"Have you ever walked through a season of hardship? How did God show you hope and comfort during that time? Reflect on your experience below and praise God for His hope.",
"What is one way God has blessed you that you're most thankful for? Write a prayer of thanksgiving.",
"Read 1 Thessalonians 5:18 and reflect on it. How can you live this out in your daily life?",
"Who has impacted your spiritual growth and helped you grow in faith? Write a short thank you note thanking God for that person.",
"When is a time or season when you felt filled with the joy of the Lord? Reflect on that experience as you thank God for complete satisfaction in Him.",
"Knowing what you know now, what would you tell your younger self to be grateful for? How has God grown you and matured you in your faith?",
"Thank God for the blessing of your favorite meal or treat. Who can you bless with a meal or a dessert in the name of Jesus?",
"Name one person from the past whose achievements have impacted your walk with the Lord. Spend time thanking God for the life of that person and pray through how you can impact the spiritual growth of others.",
"Have you ever had a close call? Thank God for His protection and the way He cares for His children.",
"Is there something you had in the past but are grateful you don't have now (either something tangible, a habit, or a relationship)? Thank God for freedom and new beginnings.",
"What do you have to do today that you don't want to do?  Praise the Lord for self-control and discipline in His name.",
"Who is one family member who isn't here anymore whom you are thankful for? Write a short note thanking God for this person and how they impacted your life.",
"What is one experience in the last 30 days you are happy to have had. How did you see God's hand at work in this situation?",
"Think of your favorite comfy outfit. Thank God for the clothes in your closet and the blessing of choosing an outfit you like, when many are not able to afford basic necessities.",
"What is one book that has impacted your spiritual growth and why?  Reflect on how this book has taught you about the Lord and spurred you on in your faith.",
"Has anyone ever done something unexpected for you that you appreciate? Describe how you felt being blessed by this person and how it was a tangible expression of God's love for you.",
"Is there someone at church whom you appreciate and who encourages you? Thank God for this person as you write why you appreciate them and how they bless you. Don't forget to tell them how much you appreciate them, too!",
"Reflect on an area of your life that God is currently pruning and refining. Write a prayer of praise thanking God for this act of love and for drawing you closer to Him.",
"What is one scientific advancement you are thankful to have? Why? Thank God for the gift intelligence and for creating those who are able to make advancements in our world.",
"What is one modern convenience you are thankful to have and why? Spending time thanking God for the ability to afford these conveniences",
"Read Jeremiah 31:3 and write a prayer of thanks for God's unfailing love.",
"Think about what you have today that you didn't have 5 or 10 years ago. How has God blessed you in the last several years?",
"Consider where you live. The country, state, city, neighborhood. It may not be perfect or ideal, but is  there anything about it that makes you fortunate to be there? Reflect on how God provided a place for you to live and dwell.",
"Most of us think we would be happier if we had or gained something. But often when God says no, it's for His glory and for His greater purpose. Reflect on the lessons God taught you  by saying no or by closing a door in your life.",
"Think about the people who do jobs in your city you never considered (ex:. the trash pickup crew.) Why are you are indebted to them? Is there something you can do to show them the kindness and love of Jesus? Reflect on how you can bless someone in the service industry in the name of Jesus.",
"As a child of God, you have been completely forgiven by Jesus' gift of grace at the cross. Write a prayer of thanks praising God for a clean slate and the grace that washes your deepest sins clean.",
"Even when you stray and wander from God&#8217;s promises, God is merciful to forgive your sins. Praise the Lord for His patience with His wayward children! Reflect on God's mercy below.",
"What are you most thankful for about your relationship with God?",
"What are some of the things you enjoyed today that someone might not have? Praise God for those basic necessities you often take for granted but would be a blessing to someone in need.",
"How do you travel from place to place on a daily basis? Thank God for the transportation you use to get to where you need to go.",
"You are a new creation in Christ! Reflect on your identity in Christ and praise God for His redemption.",
"God supplies you with strength and walks with you, even on your hardest days.  Reflect on a time when you've clung to the strength of the Lord and pressed into His strength like you never have before.",
"Read Psalm 36:7 and reflect on a time when God has been your refuge.",
"Have you ever experienced a lonely season of life? Reflect on how God comforted you and provided you hope in this time",
"Who in your life is a blessing to you on a regular basis? Write how they've impacted you and write a brief prayer of blessing over their life.",
"When have you been intentionally still before the Lord? What lessons did God teach you and how did He reveal Himself to you in your time of solitude?",
"Reflect on the first time you heard the Good News of Jesus. How old were you and who shared their faith with you? Who can you share your faith with and disciple in your own life?",
"Has a stranger or someone you didn't know very well ever taught you something that helped you grow in faith and grow closer to God? What is it and how did it impact your life?",
"Has your life ever changed is a split second or very suddenly? How was God with you in this season of life?",
"Read Deuteronomy 32:4. Reflect how God's faithfulness has impacted your life. Write a prayer of thanksgiving for God's love and faithfulness.",
"What part of waking up every morning are you most thankful for and why? Reflect on how God's mercies are new every morning.",
"What is a “God moment” that made you smile lately? How have you felt God's presence in your life recently?",
"What strength of yours are you most grateful for? Write a letter to God thanking Him for how He created you.",
"What is something that money can't buy that you are grateful for today? Thank God for a small, but meaningful blessing in your life.",
"Think about your five senses. Which are you most grateful for and why? Praise God for how He created the amazing human body.",
"Read 1 John 3:1. Reflect on the way God is your Heavenly Father and how God loves you as His child.",
"How can you bless and serve the less fortunate in God's name? Ask God to reveal ways you can serve others the way God has blessed you.",
"When is a time when God did the impossible in your life? Reflect on this situation as you praise God for moving in your life.",
"Has there been a time God provided financially for you in an unexpected way? Thank God for His provision and write a prayer of gratitude below.",
"How has a pastor or ministry leader greatly impacted your walk with God? Pray for this person and write a note of thanks for their service to the Lord.",
"Who is someone you are praying for to come to know the Lord? Write a prayer for this person and ask God to show you how to share the Good News of Jesus with confidence.",
"Has there been a situation in your life where God has healed you or a family member in an unexpected way? Write a prayer of praise to the Great Physician.",
"What worship songs help you praise the Lord and remind you of God's faithfulness? Write a few of your favorite lyrics as a way of praising God for His amazing grace.",
"Which season is your favorite? Thank God for creating the seasons and for each new day that He brings.",
"Have you received help from a person or organization in a time of need?  Reflect on how God used them to bless you and provide for your needs.",
"Who do you know that needs help in some way? Ask God to show you ways you can bless them and tangible ways you can be the hands and feet of Jesus.",
"Read 1 Chronicles 16:34. Reflect on how God's goodness endures forever and how this truth impacts your daily life.",
"Reflect on a time when you were weary and God carried you through this season. Praise God for His lovingkindness and the way He cares for His children.",
"Reflect on how God sent Jesus to dwell on Earth with human sinners. Write about how Jesus' life, death, and ministry impact your life.",
"What is a prayer that God answered that you are grateful He did? Reflect on how God hears your prayers below.",
"When is a time when God helped you live the Fruit of the Spirit in action (love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control)? Reflect how the Lord helped you stand firm in faith in a time of struggle.",
"Reflect on how God is helping you (or has helped) you overcome a bad habit or reoccurring sin in your life. How has God helped you in moments of weakness?",
"List 3 blessings in your life that are invaluable or irreplaceable. Thank God for blessing you with these things.",
"Write a prayer of thanks to God for His friendship and presence in your life. How has knowing He's close blessed you?",
"How has God helped you choose joy in a time of hardship? Reflect on the experience.",
"What are a few blessings you appreciate in the season of life you're in now? Reflect on what God is currently doing in your life and heart.",
"Who are the godly friends who spur you on to be more like Jesus? Reflect on those special friendships below.",
"Reflect on your parents and the relationship you have with them. How has God grown you through that relationship or in-spite of a difficult relationship?",
"When is a time you followed God's plan even though you didn't understand or see the way? Reflect on God's faithfulness in that season.",
"Has someone ever done something small for you that you were incredibly grateful for? Reflect on how God blessed you through a small act of kindness.",
"Has there been a time where you waited on God to move and you were frustrated with His timing? Reflect on being in the waiting room of life and your season of waiting on God.",
"Who is someone you know who regularly serves others and gives of herself for the glory of the Lord? Write a prayer for this person and brainstorm ways you can bless her life in return.",
"Read Psalm 100:1-3. Reflect on these verses and how the Lord fills you with gladness.",
"What is one character quality you like about yourself? Thank God for making you in His image and refining your character to be more like Him.",
"God created the world in a variety of vibrant shades and colors. Write a prayer of thanks praising God for the beautiful hues of the world around you.",
"List three tangible things that make your life easier. Reflect on how God blessed you when He placed these things in your life.",
"Read Psalm 34:8. Reflect on how you've experienced this in your own life",
"What is one goal you accomplished with God's help? Reflect on how you relied on the Lord to reach your goal.",
"Where do you believe God is leading you in the near future? Write a prayer of praise to God for leading and guiding your path.",
"Reflect on your favorite Bible verse and how it keeps you anchored to the promises of God.",
"Read Matthew 28:1-8.  Reflect on the empty tomb and what it means for those who are children of God.",
"This world is not your home and God is preparing a place in eternity for His children. Write a prayer of praise celebrating the promise of eternity with God!",
"Express your gratitude to someone very close to you today (like your spouse, children, close friend). Reflect on how this person draws you to Jesus and spurs you on in your spiritual growth.",
"Reflect on the ways God is kind to you and how you can show an intentional act of kindness to someone in Jesus' name.",
"Remember a time when someone showed you biblical hospitality. Thank God for that person and pray through how you can extend biblical hospitality to someone in your life.",
"Read Philippians 4:7 and reflect on a time God's peace surpassed your understanding.",
"Praise the Lord for the beautiful and majestic world He created. Reflect on your favorite things in nature  and why these creations are special to you.",
"Reflect on a time you experienced boldness and courage that came from the Lord. Write a prayer of thanks to God for walking with you and making you bold.",
"Read Isaiah 40:31. What does it mean for you to hope in the Lord? Write a prayer of praise to God for the hope you have in Him.",
"What are the character traits of God you appreciate most? Why?",
"God has already overcome evil and the darkness of this world! Write a prayer of praise thanking God for His power and might.",
"Read 2 Timothy 3:16 and write a prayer of thanksgiving for God's Holy Word.",
"Reflect on the gift of salvation at the cross. Write a prayer of thanksgiving for salvation and freedom from sin!"
]